mhs/inbound/inbound/request/tests/messages/sync_message.xml

<?xml version="1.0" encoding="utf-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:hl7="urn:hl7-org:v3">
	<SOAP-ENV:Header>
        <wsa:MessageID xmlns:SOAP="http://schemas.xmlsoap.org/soap/envelope/">uuid:{{{messageGUID}}}</wsa:MessageID>
		<wsa:Action>urn:nhs:names:services:pdsquery/QUPA_IN040000UK32</wsa:Action>
		<wsa:To>https://pds-sync.national.ncrs.nhs.uk/syncservice-pds/pds</wsa:To>
		<wsa:From>
			<wsa:Address/>
		</wsa:From>
		<hl7:communicationFunctionRcv>
			<hl7:device>
                <hl7:id xmlns:SOAP="http://schemas.xmlsoap.org/soap/envelope/" extension="{{{toASID}}}" root="1.2.826.0.1285.0.2.0.107"/>
			</hl7:device>
		</hl7:communicationFunctionRcv>
		<hl7:communicationFunctionSnd>
			<hl7:device>
                <hl7:id xmlns:SOAP="http://schemas.xmlsoap.org/soap/envelope/" extension="{{{fromASID}}}" root="1.2.826.0.1285.0.2.0.107"/>
			</hl7:device>
		</hl7:communicationFunctionSnd>
		<wsa:ReplyTo>
			<wsa:Address/>
		</wsa:ReplyTo>
	</SOAP-ENV:Header>
	<SOAP-ENV:Body>
		<QUPA_IN040000UK32 xmlns="urn:hl7-org:v3">
			<id root="9CB12D64-19FA-42CD-B403-0CC205BD5B23"/>
			<creationTime value="20101125153000"/>
			<versionCode code="V3NPfIT3.0"/>
			<interactionId root="2.16.840.1.113883.2.1.3.2.4.12" extension="QUPA_IN040000UK32"/>
			<processingCode code="P"/>
			<processingModeCode code="T"/>
			<acceptAckCode code="NE"/>
			<communicationFunctionRcv>
				<device classCode="DEV" determinerCode="INSTANCE">
                    <hl7:id xmlns:SOAP="http://schemas.xmlsoap.org/soap/envelope/" extension="{{{toASID}}}" root="1.2.826.0.1285.0.2.0.107"/>
				</device>
			</communicationFunctionRcv>
			<communicationFunctionSnd>
				<device classCode="DEV" determinerCode="INSTANCE">
                    <hl7:id xmlns:SOAP="http://schemas.xmlsoap.org/soap/envelope/" extension="{{{fromASID}}}" root="1.2.826.0.1285.0.2.0.107"/>
				</device>
			</communicationFunctionSnd>
			<ControlActEvent classCode="CACT" moodCode="EVN">
				<author1 typeCode="AUT">
					<AgentSystemSDS classCode="AGNT">
						<agentSystemSDS classCode="DEV" determinerCode="INSTANCE">
                            <hl7:id xmlns:SOAP="http://schemas.xmlsoap.org/soap/envelope/" extension="{{{fromASID}}}" root="1.2.826.0.1285.0.2.0.107"/>
						</agentSystemSDS>
					</AgentSystemSDS>
				</author1>
				<query>
					<historicDataIndicator>
						<value code="0" codeSystem="2.16.840.1.113883.2.1.3.2.4.17.36"/>
						<semanticsText>historicDataIndicator</semanticsText>
					</historicDataIndicator>
					<person.id>
						<value root="2.16.840.1.113883.2.1.4.1" extension="{{{nhsNumber}}}"/>
						<semanticsText>person.id</semanticsText>
					</person.id>
					<retrievalItem>
						<semanticsText>person.allData</semanticsText>
					</retrievalItem>
				</query>
			</ControlActEvent>
		</QUPA_IN040000UK32>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>